docs: :memo: fix README markdownlint violations
